# Pandas. Открытый курс OpenDataScience по машинному обучению
https://habr.com/ru/company/ods/blog/344044/

## Лекция 1
https://www.youtube.com/watch?v=dEFxoyJhm3Y

In [2]:
import numpy as np
import pandas as pd
data = pd.read_csv('beauty.csv', sep = ';')

In [3]:
type(data)

pandas.core.frame.DataFrame

In [4]:
data.head()

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14    4.0
1   4.28     28      0         1      0       1        1        0    12    3.0
2   7.96     35      0         1      0       1        0        0    10    4.0
3  11.57     38      0         1      0       0        1        1    16    3.0
4  11.42     27      0         1      0       0        1        0    16    3.0

In [5]:
data.shape

(1260, 10)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1260 entries, 0 to 1259
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   wage      1260 non-null   float64
 1   exper     1260 non-null   int64
 2   union     1260 non-null   int64
 3   goodhlth  1260 non-null   int64
 4   black     1260 non-null   int64
 5   female    1260 non-null   int64
 6   married   1260 non-null   int64
 7   service   1260 non-null   int64
 8   educ      1260 non-null   int64
 9   looks     1259 non-null   float64
dtypes: float64(2), int64(8)
memory usage: 98.5 KB

In [7]:
data.describe()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
count,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1259.000000
mean,6.306690,18.206349,0.272222,0.933333,0.073810,0.346032,0.691270,0.273810,12.563492,3.185862
std,4.660639,11.963485,0.445280,0.249543,0.261564,0.475892,0.462153,0.446089,2.624489,0.685130
min,1.020000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,5.000000,1.000000
25%,3.707500,8.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,12.000000,3.000000
50%,5.300000,15.000000,0.000000,1.000000,0.000000,0.000000,1.000000,0.000000,12.000000,3.000000
75%,7.695000,27.000000,1.000000,1.000000,0.000000,1.000000,1.000000,1.000000,13.000000,4.000000
max,77.720000,48.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,17.000000,5.000000

In [8]:
data['exper'].head(10)

0    30
1    28
2    35
3    38
4    27
5    20
6    12
7     5
8     5
9    12
Name: exper, dtype: int64

# loc и iloc

In [9]:
data.loc[0:10, ['wage', 'female']]

    wage  female
0   5.73       1
1   4.28       1
2   7.96       1
3  11.57       0
4  11.42       0
5   3.91       1

In [10]:
data.iloc[:5, 2:4]

   union  goodhlth
0      0         1
1      0         1
2      0         1
3      0         1
4      0         1

In [11]:
data[data['female'] == 1]['wage'].mean(), \
data[data['female'] == 0]['wage'].mean()

(4.299357798165137, 7.3688228155339806)

In [12]:
data[(data['female'] == 0) & (data['married'] == 1)]['wage'].median(), \
data[(data['female'] == 0) & (data['married'] == 0)]['wage'].median()

(6.710000000000001, 5.0649999999999995)

In [13]:
for look, s_df  in data.groupby('looks'):
    print(look, s_df['female'].mean())

1.0 0.38461538461538464
2.0 0.38028169014084506
3.0 0.3217753120665742
4.0 0.37362637362637363
5.0 0.42105263157894735

In [14]:
for look, s_df  in data.groupby(['looks', 'female']):
#     print(look)
    print(look, s_df['wage'].mean())

(1.0, 0) 6.16375
(1.0, 1) 2.154
(2.0, 0) 6.249090909090909
(2.0, 1) 3.8290740740740743
(3.0, 0) 7.598957055214724
(3.0, 1) 4.217715517241379
(4.0, 0) 7.226447368421053
(4.0, 1) 4.745073529411764
(5.0, 0) 9.923636363636364
(5.0, 1) 3.9025

In [15]:
data.groupby('looks')[['wage', 'exper']].agg(np.median)

        wage  exper
looks
1.0    3.460   32.0
2.0    4.595   18.0
3.0    5.640   18.0
4.0    5.240   12.5
5.0    4.810    8.0

In [16]:
# Сводная таблица
pd.crosstab(data['female'], data['married'])

married    0    1
female
0        166  658
1        223  213

In [17]:
# Сводная таблица для прогноза рейтинга привлекательности
pd.crosstab(data['female'], data['looks'])

looks   1.0  2.0  3.0  4.0  5.0
female
0         8   88  489  228   11
1         5   54  232  136    8

In [18]:
data['wage'].describe()

count    1260.000000
mean        6.306690
std         4.660639
min         1.020000
25%         3.707500
50%         5.300000
75%         7.695000
max        77.720000
Name: wage, dtype: float64

In [20]:
data['wage'].quantile(.75)

7.695

In [32]:
# Добавляем столбец is_rich (заполняем значениями по признаку больше квантиля 0.75 => ,богатый = 1)
data['is_rich'] = (data['wage'] > data['wage'].quantile(0.75)).astype('int64')

In [30]:
data.head()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks,is_rich
0,5.73,30,0,1,0,1,1,1,14,4.0,0
1,4.28,28,0,1,0,1,1,0,12,3.0,0
2,7.96,35,0,1,0,1,0,0,10,4.0,1
3,11.57,38,0,1,0,0,1,1,16,3.0,1
4,11.42,27,0,1,0,0,1,0,16,3.0,1

In [42]:
# Определеям функцию
def string_gender(female):   
    return 'female' if female else 'male'

In [44]:
data['female'].apply(string_gender)

0       female
1       female
2       female
3         male
4         male
         ...
1255    female
1256    female
1257    female
1258    female
1259    female
Name: female, Length: 1260, dtype: object

In [46]:
# ТО же, но через lambda-функцию
data['female'].apply(lambda female: 'female' if female else 'male')

0       female
1       female
2       female
3         male
4         male
         ...
1255    female
1256    female
1257    female
1258    female
1259    female
Name: female, Length: 1260, dtype: object

In [47]:
# Определяем слорварь
d_union = {1: 'union', 0: 'non-union'}
# Используем функцию map для вывода нужных значений
data['union'].map(d_union).head(10)

0    non-union
1    non-union
2    non-union
3    non-union
4    non-union
5    non-union
6    non-union
7        union
8    non-union
9    non-union
Name: union, dtype: object